def insertion_sort(A):
    '''
    После i итераций срез A:[0:i+1] отсортирован,
    при этом все эл-ты, начиная с A[i+1] стоят на прежних местах.
    N-1 итерация
    O(N**2)
    '''
    for i in range(1, len(A)): #i - номер итерации
        tmp = A[i] #фиксируем эл-т, с которым сравниваем
        k = i-1 #сравниваемый с tmp элемент
        while k >=0 and A[k] > tmp: #идём вниз, запомнив tmp как минимальный эл-т в цикле
            A[k+1] = A[k]  #и выбрасываем k-шный элемент наверх, сохраняя порядок
            k -= 1
        A[k+1] = tmp


from test_list import *


print(insertion_sort(A))
"""
[5, 6, 6, 2, 4, 1]
[5, 5, 6, 2, 4, 1]
[3, 5, 6, 6, 4, 1]
[3, 5, 5, 6, 4, 1]
[3, 3, 5, 6, 4, 1]
[2, 3, 5, 6, 6, 1]
[2, 3, 5, 5, 6, 1]
[2, 3, 4, 5, 6, 6]
[2, 3, 4, 5, 5, 6]
[2, 3, 4, 4, 5, 6]
[2, 3, 3, 4, 5, 6]
[2, 2, 3, 4, 5, 6]
[1, 2, 3, 4, 5, 6]
"""
