def bubble_sort(A):
    '''
    После i итераций i эл-тов в конце стоят на своих местах.
    N-1 итерация
    O(N**2)
    '''
    for prohod in range(1, len(A)):
        for i in range(0, len(A)-prohod):
            if A[i] > A[i+1]:
                A[i], A[i+1] = A[i+1], A[i]


from test_list import *


print(bubble_sort(A))
"""
[5, 3, 6, 2, 4, 1]
[5, 3, 2, 6, 4, 1]
[5, 3, 2, 4, 6, 1]
[5, 3, 2, 4, 1, 6]
[3, 5, 2, 4, 1, 6]
[3, 2, 5, 4, 1, 6]
[3, 2, 4, 5, 1, 6]
[3, 2, 4, 1, 5, 6]
[2, 3, 4, 1, 5, 6]
[2, 3, 1, 4, 5, 6]
[2, 1, 3, 4, 5, 6]
[1, 2, 3, 4, 5, 6]
"""